{
	"homepage": "https://minecraft.curseforge.com/projects/randomportals",
	"1.12.2": {
		"1.12.2-1.6.3.2": "Added a configuration option to allow all entities to cause portal generation upon teleportation through a portal.\nDisabling colored portals now fully disables all dyeing behavior.\nImproved the teleportation logic.",
		"1.12.2-1.6.3.1": "Fixed a crash related to advancements.",
		"1.12.2-1.6.3.0": "Fixed instant portal teleportation in survival mode.\nInvalid corner frame blocks are no longer cloned.\nFixed a teleportation crash.",
		"1.12.2-1.6.2.1": "Improved portal type validation.",
		"1.12.2-1.6.2.0": "Fixed invalid dimension IDs causing the game to crash.\nThe portal search radius and portal generation location search radius are now configurable.",
		"1.12.2-1.6.1.0": "Improved the teleportation logic.",
		"1.12.2-1.6.0.0": "Invalid portal type JSONs are no longer deleted.\nFixed a teleportation crash.\n/rporeload and /rporeloadclient now list the loaded portal type groups.\nSingle portal blocks can now be dyed by right clicking on them.\nZombie pigman spawn rates are now configurable for each portal type.\nImproved the advancements. Advancements can now be disabled in the configuration.\nPortals now contribute to beacon colors and have map colors.",
		"1.12.2-1.5.0.2": "Fixed a teleportation crash.",
		"1.12.2-1.5.0.1": "Improved Cubic Chunks compatibility.",
		"1.12.2-1.5.0.0": "Revamped the portal configuration system and teleportation logic. There are now many more options to configure, however, custom portal types created prior to this version are not compatible.\nRandomPortals no longer requires RandomPatches Integration.\nAdded advancements for activating a lateral Nether portal over 100 blocks large and dyeing a Nether portal red.\nMany bug fixes and improvements.",
		"1.12.2-1.4.1.1": "Improved the configuration.",
		"1.12.2-1.4.1.0": "Bug fixes and improvements.",
		"1.12.2-1.4.0.0": "Added more portal events.\nRenamed \"nether_portal_types\" to \"portal_types\". Any preexisting portal types will be migrated to the new directory.\nMiscellaneous improvements.",
		"1.12.2-1.3.0.1": "Fixed a crash.",
		"1.12.2-1.3.0.0": "Improved the configuration.",
		"1.12.2-1.2.0.0": "Improved custom Nether portal types and activators.\nBug fixes and improvements.",
		"1.12.2-1.1.0.0": "Improved the colored portal textures.\nImproved the portal rendering logic.\nMultiple colors can now be defined for Nether portal types.\nActivators can now be defined for Nether portal types.\nMiscellaneous bug fixes and improvements.",
		"1.12.2-1.0.0.0": "Added colored portals. Portals are now dyeable.\nWhen portals are activated, user placed portal blocks are no longer replaced, which makes it easier to create colored patterns.\nVillagers now sometimes spawn with vertical End portal frames on their head.\nTeleportation delays can now be specified for custom Nether portal types.\nRemoved the global Nether portal size JSONs and the all_variants size JSONs.\nBug fixes and improvements.",
		"1.12.2-0.9.0.1": "Fixed MovingWorld compatibility.",
		"1.12.2-0.9.0.0": "Receiving Nether portals are now persistent, making NetherPortalFix and similar mods obsolete. It should be noted that receiving portals will reset if they do not have a valid frame or are of a different type, and will not remain persistent if the sending portal was activated before this version of RandomPortals was installed.\nBug fixes and improvements.\nAny custom Nether portals in preexisting worlds will revert to vanilla Nether portal behavior.",
		"1.12.2-0.8.0.0": "Bug fixes and improvements.",
		"1.12.2-0.7.0.0": "RandomPortals now requires RandomPatches Integration.\nBug fixes and improvements.",
		"1.12.2-0.6.0.0": "Renamed the mod to RandomPortals.\nBug fixes and improvements.\nAny vertical and upside down End portals in preexisting worlds will have to be reactivated for them to render properly.\nAny custom Nether portals in preexisting worlds will revert to vanilla Nether portal behavior.",
		"1.12.2-0.5.0.0": "Added the \"type\" and \"canBeActivatedByFire\" properties to Nether portal types.\nBug fixes and improvements.",
		"1.12.2-0.4.0.0": "Required corners are now configurable for Nether portal types.\nGenerated portal frame dropping can now be disabled for Nether portal types.\nBug fixes and improvements.",
		"1.12.2-0.3.0.0": "Improved Nether portal types. Ore dictionary names and meta values can now be specified.\nBug fixes and improvements.",
		"1.12.2-0.2.0.0": "Implemented Nether portal types.\nBug fixes and improvements.",
		"1.12.2-0.1.0.0": "Initial alpha release."
	},
	"promos": {
		"1.12.2-latest": "1.12.2-1.6.3.1",
		"1.12.2-recommended": "1.12.2-1.6.3.1"
	}
}
